tests/performance/results/Transaksi/TC02-A summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
[TC02-A] GET /login,100,282,14,1744,430.84,0.000%,3.30240,16.06,0.83,4979.0
[TC02-A] POST /login,100,431,86,1924,507.77,0.000%,3.28504,69.09,6.82,21537.0
[TC02-A] GET /transaksi (500 User),100,168,26,1743,287.57,0.000%,3.28299,335.05,3.16,104506.0
TOTAL,300,294,14,1924,432.45,0.000%,9.75515,416.06,10.70,43674.0